src/DataProcessors/ПодборВыданыхПокупок/ПодборВыданыхПокупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПодборВыданыхПокупок</name>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокВозврата</name>
    <comment>В днях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыданныеПокупки</name>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>DefinedType.ТипыЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>Расход</name>
      <type>
        <types>DocumentRef.Расходная</types>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>Списано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасхода</name>
      <type>
        <types>EnumRef.ТипРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.Организаторы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/AccumulationRegisters/Расход/Расход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Расход</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Покупка</name>
    <type>
      <types>DefinedType.ТипыЗаказа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Списано</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРасхода</name>
    <type>
      <types>EnumRef.ТипРасхода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БесплатнаяВыдача</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Расходная/Расходная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расходная</name>
  <registerRecords>InformationRegister.ОбменССайтом</registerRecords>
  <registerRecords>AccumulationRegister.Расход</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>InformationRegister.Обмен100сп</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>InformationRegister.Обмен100спСообщения</registerRecords>
  <registerRecords>AccumulationRegister.КПолучению</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Возвраты</registerRecords>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>Списать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Напечатано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоискНикаСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автозаполнение</name>
    <type>
      <types>CatalogRef.ГруппыУчастников</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьОплачиваетОрганизатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВыдачи</name>
    <type>
      <types>EnumRef.СтатусыВыдачиПокупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоискЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КартаУчастника</name>
    <type>
      <types>CatalogRef.КартыУчастников</types>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧекаККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСменыККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЧековККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Архивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаВыполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылочныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПробитЧекОтмены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Потерян</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
        <types>CatalogRef.Посылки</types>
        <types>CatalogRef.Пристрой</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяХранения</name>
      <comment>в днях</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.Движение</types>
        <types>DocumentRef.КорректировкаЗаписейРегистров</types>
        <types>DocumentRef.Приходная</types>
        <types>DocumentRef.ПоступлениеПристроя</types>
        <types>DocumentRef.РазборКоробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Оплатить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДляСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПокупкаСсылка</name>
      <type>
        <types>CatalogRef.Покупки</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Праздники</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьХранения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьИтого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>ПокупкаСпр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПерваяТочка</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>БесплатнаяВыдача</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОплачиваетОрганизатор</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОплачиваетУчастник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.КартыУчастников</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/ПодборВыданыхПокупок/Forms/Форма/Module.bsl
&НаКлиенте
Процедура УчастникПриИзменении(Элемент)
//	ПриВыбореУчастника(Объект.Участник,Объект.СрокВозврата);
     ЗаполнитьТабЧасть();
	 ОбновитьОтображениеДанных();
КонецПроцедуры


Процедура ПриВыбореУчастника(Участник,СрокВозврата)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяПокупки.Ссылка КАК Расход,
		|	РасходнаяПокупки.Покупка
		|ИЗ
		|	Документ.Расходная.Покупки КАК РасходнаяПокупки
		|ГДЕ
		|	РасходнаяПокупки.Ссылка.Проведен
		|	И РасходнаяПокупки.Ссылка.Участник = &Участник
		|	И РасходнаяПокупки.Ссылка.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, &СрокВозврата * -1) И &КонецПериода";

	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("СрокВозврата", СрокВозврата);
	Запрос.УстановитьПараметр("Участник", Участник);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Объект.ВыданныеПокупки.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Объект.СрокВозврата=14;
	ЗаполнитьТабЧасть();
	ОбновитьОтображениеДанных();
	Элементы.Участник.ТолькоПросмотр=Истина;
КонецПроцедуры

Процедура ЗаполнитьТабЧасть()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(РасходОбороты.Покупка) = ТИП(Справочник.Посылки)
		|			ТОГДА РасходОбороты.Покупка.Покупка
		|		ИНАЧЕ РасходОбороты.Покупка
		|	КОНЕЦ КАК Покупка,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(РасходОбороты.Покупка) = ТИП(ЧИСЛО)
		|			ТОГДА РасходОбороты.Покупка
		|		ИНАЧЕ РасходОбороты.Покупка.Код
		|	КОНЕЦ КАК КодПокупки,
		|	РасходОбороты.ТипРасхода КАК ТипРасхода,
		|	РасходОбороты.Списано КАК Списано,
		|	РасходОбороты.Участник КАК Участник,
		|	РасходОбороты.Габарит КАК Габарит,
		|	РасходОбороты.Регистратор КАК Расход,
		|	Организаторы.Ссылка КАК Организатор
		|ИЗ
		|	РегистрНакопления.Расход.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК РасходОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организаторы КАК Организаторы
		|		ПО РасходОбороты.Покупка.Организатор.Код = Организаторы.Код
		|ГДЕ
		|	РасходОбороты.Участник = &Участник
		|
		|УПОРЯДОЧИТЬ ПО
		|	РасходОбороты.Период";

	Запрос.УстановитьПараметр("Участник", Объект.Участник);
    Запрос.УстановитьПараметр("НачалоПериода", КонецДня(Объект.НаДату)-Объект.СрокВозврата*24*60*60);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.НаДату));
	
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

    Объект.ВыданныеПокупки.Загрузить(Результат.Выгрузить());

	
	
КонецПроцедуры	

&НаКлиенте
Процедура СрокВозвратаПриИзменении(Элемент)
	ЗаполнитьТабЧасть();
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	сз=новый СписокЗначений;
	масс_выбран=Объект.ВыданныеПокупки.НайтиСтроки(новый структура("Пометка",Истина));
	Для каждого стр из масс_выбран Цикл
		Если стр.Пометка Тогда
			сз.Добавить(стр);
		КонецЕсли;
	КонецЦикла;	             
	ОповеститьОВыборе(сз);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.СрокВозврата=Константы.ДниВозврата.Получить();
КонецПроцедуры


Процедура ЗаполнитьДаннымиССайта()
	СписокУчастников=Новый СписокЗначений;
	СписокУчастников.Добавить(Объект.Участник.Код);
	
	ВыданныеПокупки_ССайта=СтоСПОбмен_Возвраты.Загрузить_ВыданныеПокупки(СписокУчастников,Объект.СрокВозврата);
	тз=ВыданныеПокупки_ССайта.Результат;
	тз.Колонки.Добавить("Организатор");
	тз.Колонки.ДатаВыдачи.Имя="Расход";
	Для каждого стр из тз Цикл
		стр.Организатор=СП_РаботаСоСправочниками.ПолучитьОрганизатораПо_Коду(стр.Покупка.Организатор.Код);
	КонецЦикла;	
	Если ВыданныеПокупки_ССайта.авторизацияВыполнена Тогда
		Объект.ВыданныеПокупки.Загрузить(ВыданныеПокупки_ССайта.Результат);
	КонецЕсли;	
		
Конецпроцедуры	

&НаКлиенте
Процедура ССайта(Команда)
	ЗаполнитьДаннымиССайта();
КонецПроцедуры
